const calc = expression => {
    const a = expression.split(' ');     //розділ строку на символи(пробілом)

    let result;
    switch (a[1]) {      //провіряю який в змінній а оператор (індекс елем 1)
        case '+':      //в випадку якщо це +
            //return a[0] + a[2]; елемент з індексом 0 + ел з інд 2 призводить до конкатинаціі (видає 12)
            result = Number(a[0] + +a[2]); //тому переводим з строк в цифри
            break;
        case '-':
            result = a[0] - a[2]; 
            break;
        case '*':
            result = a[0] * a[2];
            break;
        case '/':
            result = a[0] / a[2];
            break;
    }
    return expression + " = " + result;
};
console.log(calc('5 * 2'));



/*Создайте ф-цию, которая будет принимать выражение на вход и вернет результат вычислений

Основные требования:
Функция должна называться calc
Функция должна принимать как аргумент строку в формате число, пробел, оператор, число (1' + 2')
Должны поддерживаться операции + - * /
Функция должна вернуть ответ в формате '1 + 2 = 3', где строка '1 + 2' была передана на вход*/